<template>
    <div class="max-w-6xl mx-auto px-4 py-8">
    <!-- Заголовок -->
    <h1 class="text-3xl font-bold mb-6">
        О проекте
    </h1>

    <p class="text-body mb-4">Данное приложение является некоммерческим веб-клиентом, использующим публичный API платформы Smotrim.ru для прослушивания подкастов российских радиостанций: «Вести ФМ», «Маяк» и другие.</p>

    <p class="text-body mb-4">Исходный код приложения распространяется на <a href="https://github.com/coyotle/smotrim-webapp" class="font-medium text-fg-brand underline hover:no-underline">GitHub</a> под лицензией MIT.</p>

    <p class="text-body mb-4">Все аудиоматериалы, изображения, названия программ, тексты анонсов и иные медиаданные являются собственностью их правообладателей. Приложение не хранит и не распространяет медиаконтент, а лишь предоставляет технический доступ к материалам, уже опубликованным на платформе Smotrim.ru (ВГТРК), выступая в роли клиента-прокси.</p>

    <p class="text-body mb-4">Разработчик приложения не несёт ответственности за содержание предоставляемых материалов, так как они полностью контролируются и размещаются третьей стороной.</p>

    <p class="text-body mb-4">Если у вас есть вопросы или претензии, связанные с правами на используемые материалы, пожалуйста, направляйте их по адресу <a href="mailto:me@coyotle.ru" class="font-medium text-fg-brand underline hover:no-underline">me@coyotle.ru</a>.</p>
    </div>
</template>